<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 *
 *
 * @package    local_edai_pdf
 * @copyright  2024 Edunao SAS (contact@edunao.com)
 * @author     Pierre FACQ <pierre.facq@edunao.com>
 * @license    http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

namespace local_edai_pdf\module;

defined('MOODLE_INTERNAL') || die();

class page extends module_base {

    protected function get_identifier() : string {
        return 'page';
    }

    protected function get_module_name() : string {
        return 'page';
    }

    /**
     * Provides module-specific context information.
     *
     * @param \moodle_database $db
     * @param object $cm
     * @return string
     * @throws \moodle_exception
     */
    public function get_context(\moodle_database $db, object $cm): string {
        $page = $db->get_record('page', ['id' => $cm->instance], '*', MUST_EXIST);
        $context = <<<EOL
        Custom Module Information:
        - Name: {$page->name}
        - Intro: {$page->intro}
        - Content: {$page->content}
        
        EOL;
        return $context;
    }

    /**
     * Exports the page module content to HTML for PDF.
     *
     * @param \moodle_database $db The Moodle database instance.
     * @param object $cm The course module record.
     * @return string HTML content representing the page module.
     */
    public function export_to_pdf(\moodle_database $db, object $cm): string {
        $page = $db->get_record('page', ['id' => $cm->instance], '*', MUST_EXIST);
        $context = \context_module::instance($cm->id);

        // Emoji replacement.
        $page->content = $this->replace_emoji_with_images($page->content);

        // Rewrite pluginfile URLs.
        $page->content = file_rewrite_pluginfile_urls($page->content, 'pluginfile.php', $context->id, 'mod_page', 'content', $page->revision);

        // Format content using Moodle's format_text with filters.
        $content = format_text($page->content, $page->contentformat, [
            'context' => $context,
            'trusted' => true,
            'filter' => true,
            'noclean' => true
        ]);

        // Initialize DOMDocument and load the HTML content.
        $dom = new \DOMDocument();
        // Suppress errors due to malformed HTML.
        libxml_use_internal_errors(true);
        $dom->loadHTML('<?xml encoding="utf-8" ?>' . $content, LIBXML_HTML_NOIMPLIED | LIBXML_HTML_NODEFDTD);
        libxml_clear_errors();

        // Get all script tags.
        $scripts = $dom->getElementsByTagName('script');
        // Since DOMNodeList is live, we need to iterate in reverse to safely remove nodes.
        for ($i = $scripts->length - 1; $i >= 0; $i--) {
            $script = $scripts->item($i);
            if ($script->getAttribute('type') === 'math/tex') {
                $script->parentNode->removeChild($script);
            }
        }

        $rootsize = 15; // In px
        $this->fixRelativeUnits($dom, $rootsize, $rootsize);

        // Save the cleaned off of script tags HTML to avoid brut text formulas display inside PDF.
        $cleanedcontent = $dom->saveHTML();

        // Return content.
        return '<div>' . $cleanedcontent . '</div>';
    }

    // Function to recursively fix em and rem units.
    public function fixRelativeUnits(\DOMNode $node, int $rootsize, int $fontsize) {
        if ($node->hasAttributes()) {
            // Attributes to match.
            $attributes = ['style', 'height', 'width'];

            foreach ($attributes as $attribute) {
                if ($item = $node->attributes->getNamedItem($attribute)) {
                    $value = $item->nodeValue;

                    // Fix rem units.
                    $newvalue = preg_replace_callback('/(\d*\.?\d+)rem/', function ($matches) use ($rootsize) {
                        return ((int) $matches[1] * $rootsize) . 'px';
                    }, $value);

                    // Fix em units.
                    $newvalue = preg_replace_callback('/(\d*\.?\d+)em/', function ($matches) use (&$fontsize) {
                        $fontsize = ((int) $matches[1] * $fontsize);
                        return $fontsize . 'px';
                    }, $newvalue);

                    if ($value !== $newvalue) {
                        $node->setAttribute($attribute, $newvalue);
                    }
                }
            }
        }

        // Recursively iterate through child nodes
        foreach ($node->childNodes as $child) {
            $this->fixRelativeUnits($child, $rootsize,$fontsize);
        }
    }

    public function replace_emoji_with_images($content) {
        global $CFG;

        // All emojis sorted by length in descending order.
        // https://charlottebuff.com/unicode/misc/emoji-length/
        $allemojis =
        // 10 characters
        "👨🏻‍❤️‍💋‍👨🏻 👨🏻‍❤️‍💋‍👨🏼 👨🏻‍❤️‍💋‍👨🏽 👨🏻‍❤️‍💋‍👨🏾 👨🏻‍❤️‍💋‍👨🏿 👨🏼‍❤️‍💋‍👨🏻 👨🏼‍❤️‍💋‍👨🏼 👨🏼‍❤️‍💋‍👨🏽 👨🏼‍❤️‍💋‍👨🏾 👨🏼‍❤️‍💋‍👨🏿 👨🏽‍❤️‍💋‍👨🏻 👨🏽‍❤️‍💋‍👨🏼 👨🏽‍❤️‍💋‍👨🏽 👨🏽‍❤️‍💋‍👨🏾 👨🏽‍❤️‍💋‍👨🏿 👨🏾‍❤️‍💋‍👨🏻 👨🏾‍❤️‍💋‍👨🏼 👨🏾‍❤️‍💋‍👨🏽 👨🏾‍❤️‍💋‍👨🏾 👨🏾‍❤️‍💋‍👨🏿 👨🏿‍❤️‍💋‍👨🏻 👨🏿‍❤️‍💋‍👨🏼 👨🏿‍❤️‍💋‍👨🏽 👨🏿‍❤️‍💋‍👨🏾 👨🏿‍❤️‍💋‍👨🏿 👩🏻‍❤️‍💋‍👨🏻 👩🏻‍❤️‍💋‍👨🏼 👩🏻‍❤️‍💋‍👨🏽 👩🏻‍❤️‍💋‍👨🏾 👩🏻‍❤️‍💋‍👨🏿 👩🏻‍❤️‍💋‍👩🏻 👩🏻‍❤️‍💋‍👩🏼 👩🏻‍❤️‍💋‍👩🏽 👩🏻‍❤️‍💋‍👩🏾 👩🏻‍❤️‍💋‍👩🏿 👩🏼‍❤️‍💋‍👨🏻 👩🏼‍❤️‍💋‍👨🏼 👩🏼‍❤️‍💋‍👨🏽 👩🏼‍❤️‍💋‍👨🏾 👩🏼‍❤️‍💋‍👨🏿 👩🏼‍❤️‍💋‍👩🏻 👩🏼‍❤️‍💋‍👩🏼 👩🏼‍❤️‍💋‍👩🏽 👩🏼‍❤️‍💋‍👩🏾 👩🏼‍❤️‍💋‍👩🏿 👩🏽‍❤️‍💋‍👨🏻 👩🏽‍❤️‍💋‍👨🏼 👩🏽‍❤️‍💋‍👨🏽 👩🏽‍❤️‍💋‍👨🏾 👩🏽‍❤️‍💋‍👨🏿 👩🏽‍❤️‍💋‍👩🏻 👩🏽‍❤️‍💋‍👩🏼 👩🏽‍❤️‍💋‍👩🏽 👩🏽‍❤️‍💋‍👩🏾 👩🏽‍❤️‍💋‍👩🏿 👩🏾‍❤️‍💋‍👨🏻 👩🏾‍❤️‍💋‍👨🏼 👩🏾‍❤️‍💋‍👨🏽 👩🏾‍❤️‍💋‍👨🏾 👩🏾‍❤️‍💋‍👨🏿 👩🏾‍❤️‍💋‍👩🏻 👩🏾‍❤️‍💋‍👩🏼 👩🏾‍❤️‍💋‍👩🏽 👩🏾‍❤️‍💋‍👩🏾 👩🏾‍❤️‍💋‍👩🏿 👩🏿‍❤️‍💋‍👨🏻 👩🏿‍❤️‍💋‍👨🏼 👩🏿‍❤️‍💋‍👨🏽 👩🏿‍❤️‍💋‍👨🏾 👩🏿‍❤️‍💋‍👨🏿 👩🏿‍❤️‍💋‍👩🏻 👩🏿‍❤️‍💋‍👩🏼 👩🏿‍❤️‍💋‍👩🏽 👩🏿‍❤️‍💋‍👩🏾 👩🏿‍❤️‍💋‍👩🏿 🧑🏻‍❤️‍💋‍🧑🏼 🧑🏻‍❤️‍💋‍🧑🏽 🧑🏻‍❤️‍💋‍🧑🏾 🧑🏻‍❤️‍💋‍🧑🏿 🧑🏼‍❤️‍💋‍🧑🏻 🧑🏼‍❤️‍💋‍🧑🏽 🧑🏼‍❤️‍💋‍🧑🏾 🧑🏼‍❤️‍💋‍🧑🏿 🧑🏽‍❤️‍💋‍🧑🏻 🧑🏽‍❤️‍💋‍🧑🏼 🧑🏽‍❤️‍💋‍🧑🏾 🧑🏽‍❤️‍💋‍🧑🏿 🧑🏾‍❤️‍💋‍🧑🏻 🧑🏾‍❤️‍💋‍🧑🏼 🧑🏾‍❤️‍💋‍🧑🏽 🧑🏾‍❤️‍💋‍🧑🏿 🧑🏿‍❤️‍💋‍🧑🏻 🧑🏿‍❤️‍💋‍🧑🏼 🧑🏿‍❤️‍💋‍🧑🏽 🧑🏿‍❤️‍💋‍🧑🏾" .
        // 8 characters
        " 🏃🏻‍♀️‍➡️ 🏃🏻‍♂️‍➡️ 🏃🏼‍♀️‍➡️ 🏃🏼‍♂️‍➡️ 🏃🏽‍♀️‍➡️ 🏃🏽‍♂️‍➡️ 🏃🏾‍♀️‍➡️ 🏃🏾‍♂️‍➡️ 🏃🏿‍♀️‍➡️ 🏃🏿‍♂️‍➡️ 👨‍❤️‍💋‍👨 👨🏻‍❤️‍👨🏻 👨🏻‍❤️‍👨🏼 👨🏻‍❤️‍👨🏽 👨🏻‍❤️‍👨🏾 👨🏻‍❤️‍👨🏿 👨🏼‍❤️‍👨🏻 👨🏼‍❤️‍👨🏼 👨🏼‍❤️‍👨🏽 👨🏼‍❤️‍👨🏾 👨🏼‍❤️‍👨🏿 👨🏽‍❤️‍👨🏻 👨🏽‍❤️‍👨🏼 👨🏽‍❤️‍👨🏽 👨🏽‍❤️‍👨🏾 👨🏽‍❤️‍👨🏿 👨🏾‍❤️‍👨🏻 👨🏾‍❤️‍👨🏼 👨🏾‍❤️‍👨🏽 👨🏾‍❤️‍👨🏾 👨🏾‍❤️‍👨🏿 👨🏿‍❤️‍👨🏻 👨🏿‍❤️‍👨🏼 👨🏿‍❤️‍👨🏽 👨🏿‍❤️‍👨🏾 👨🏿‍❤️‍👨🏿 👩‍❤️‍💋‍👨 👩‍❤️‍💋‍👩 👩🏻‍❤️‍👨🏻 👩🏻‍❤️‍👨🏼 👩🏻‍❤️‍👨🏽 👩🏻‍❤️‍👨🏾 👩🏻‍❤️‍👨🏿 👩🏻‍❤️‍👩🏻 👩🏻‍❤️‍👩🏼 👩🏻‍❤️‍👩🏽 👩🏻‍❤️‍👩🏾 👩🏻‍❤️‍👩🏿 👩🏼‍❤️‍👨🏻 👩🏼‍❤️‍👨🏼 👩🏼‍❤️‍👨🏽 👩🏼‍❤️‍👨🏾 👩🏼‍❤️‍👨🏿 👩🏼‍❤️‍👩🏻 👩🏼‍❤️‍👩🏼 👩🏼‍❤️‍👩🏽 👩🏼‍❤️‍👩🏾 👩🏼‍❤️‍👩🏿 👩🏽‍❤️‍👨🏻 👩🏽‍❤️‍👨🏼 👩🏽‍❤️‍👨🏽 👩🏽‍❤️‍👨🏾 👩🏽‍❤️‍👨🏿 👩🏽‍❤️‍👩🏻 👩🏽‍❤️‍👩🏼 👩🏽‍❤️‍👩🏽 👩🏽‍❤️‍👩🏾 👩🏽‍❤️‍👩🏿 👩🏾‍❤️‍👨🏻 👩🏾‍❤️‍👨🏼 👩🏾‍❤️‍👨🏽 👩🏾‍❤️‍👨🏾 👩🏾‍❤️‍👨🏿 👩🏾‍❤️‍👩🏻 👩🏾‍❤️‍👩🏼 👩🏾‍❤️‍👩🏽 👩🏾‍❤️‍👩🏾 👩🏾‍❤️‍👩🏿 👩🏿‍❤️‍👨🏻 👩🏿‍❤️‍👨🏼 👩🏿‍❤️‍👨🏽 👩🏿‍❤️‍👨🏾 👩🏿‍❤️‍👨🏿 👩🏿‍❤️‍👩🏻 👩🏿‍❤️‍👩🏼 👩🏿‍❤️‍👩🏽 👩🏿‍❤️‍👩🏾 👩🏿‍❤️‍👩🏿 🚶🏻‍♀️‍➡️ 🚶🏻‍♂️‍➡️ 🚶🏼‍♀️‍➡️ 🚶🏼‍♂️‍➡️ 🚶🏽‍♀️‍➡️ 🚶🏽‍♂️‍➡️ 🚶🏾‍♀️‍➡️ 🚶🏾‍♂️‍➡️ 🚶🏿‍♀️‍➡️ 🚶🏿‍♂️‍➡️ 🧎🏻‍♀️‍➡️ 🧎🏻‍♂️‍➡️ 🧎🏼‍♀️‍➡️ 🧎🏼‍♂️‍➡️ 🧎🏽‍♀️‍➡️ 🧎🏽‍♂️‍➡️ 🧎🏾‍♀️‍➡️ 🧎🏾‍♂️‍➡️ 🧎🏿‍♀️‍➡️ 🧎🏿‍♂️‍➡️ 🧑🏻‍❤️‍🧑🏼 🧑🏻‍❤️‍🧑🏽 🧑🏻‍❤️‍🧑🏾 🧑🏻‍❤️‍🧑🏿 🧑🏼‍❤️‍🧑🏻 🧑🏼‍❤️‍🧑🏽 🧑🏼‍❤️‍🧑🏾 🧑🏼‍❤️‍🧑🏿 🧑🏽‍❤️‍🧑🏻 🧑🏽‍❤️‍🧑🏼 🧑🏽‍❤️‍🧑🏾 🧑🏽‍❤️‍🧑🏿 🧑🏾‍❤️‍🧑🏻 🧑🏾‍❤️‍🧑🏼 🧑🏾‍❤️‍🧑🏽 🧑🏾‍❤️‍🧑🏿 🧑🏿‍❤️‍🧑🏻 🧑🏿‍❤️‍🧑🏼 🧑🏿‍❤️‍🧑🏽 🧑🏿‍❤️‍🧑🏾" .
        // 7 characters
        " 🏃‍♀️‍➡️ 🏃‍♂️‍➡️ 🏴󠁧󠁢󠁥󠁮󠁧󠁿 🏴󠁧󠁢󠁳󠁣󠁴󠁿 🏴󠁧󠁢󠁷󠁬󠁳󠁿 👨‍👨‍👦‍👦 👨‍👨‍👧‍👦 👨‍👨‍👧‍👧 👨‍👩‍👦‍👦 👨‍👩‍👧‍👦 👨‍👩‍👧‍👧 👨🏻‍🤝‍👨🏼 👨🏻‍🤝‍👨🏽 👨🏻‍🤝‍👨🏾 👨🏻‍🤝‍👨🏿 👨🏻‍🦯‍➡️ 👨🏻‍🦼‍➡️ 👨🏻‍🦽‍➡️ 👨🏼‍🤝‍👨🏻 👨🏼‍🤝‍👨🏽 👨🏼‍🤝‍👨🏾 👨🏼‍🤝‍👨🏿 👨🏼‍🦯‍➡️ 👨🏼‍🦼‍➡️ 👨🏼‍🦽‍➡️ 👨🏽‍🤝‍👨🏻 👨🏽‍🤝‍👨🏼 👨🏽‍🤝‍👨🏾 👨🏽‍🤝‍👨🏿 👨🏽‍🦯‍➡️ 👨🏽‍🦼‍➡️ 👨🏽‍🦽‍➡️ 👨🏾‍🤝‍👨🏻 👨🏾‍🤝‍👨🏼 👨🏾‍🤝‍👨🏽 👨🏾‍🤝‍👨🏿 👨🏾‍🦯‍➡️ 👨🏾‍🦼‍➡️ 👨🏾‍🦽‍➡️ 👨🏿‍🤝‍👨🏻 👨🏿‍🤝‍👨🏼 👨🏿‍🤝‍👨🏽 👨🏿‍🤝‍👨🏾 👨🏿‍🦯‍➡️ 👨🏿‍🦼‍➡️ 👨🏿‍🦽‍➡️ 👩‍👩‍👦‍👦 👩‍👩‍👧‍👦 👩‍👩‍👧‍👧 👩🏻‍🤝‍👨🏼 👩🏻‍🤝‍👨🏽 👩🏻‍🤝‍👨🏾 👩🏻‍🤝‍👨🏿 👩🏻‍🤝‍👩🏼 👩🏻‍🤝‍👩🏽 👩🏻‍🤝‍👩🏾 👩🏻‍🤝‍👩🏿 👩🏻‍🦯‍➡️ 👩🏻‍🦼‍➡️ 👩🏻‍🦽‍➡️ 👩🏼‍🤝‍👨🏻 👩🏼‍🤝‍👨🏽 👩🏼‍🤝‍👨🏾 👩🏼‍🤝‍👨🏿 👩🏼‍🤝‍👩🏻 👩🏼‍🤝‍👩🏽 👩🏼‍🤝‍👩🏾 👩🏼‍🤝‍👩🏿 👩🏼‍🦯‍➡️ 👩🏼‍🦼‍➡️ 👩🏼‍🦽‍➡️ 👩🏽‍🤝‍👨🏻 👩🏽‍🤝‍👨🏼 👩🏽‍🤝‍👨🏾 👩🏽‍🤝‍👨🏿 👩🏽‍🤝‍👩🏻 👩🏽‍🤝‍👩🏼 👩🏽‍🤝‍👩🏾 👩🏽‍🤝‍👩🏿 👩🏽‍🦯‍➡️ 👩🏽‍🦼‍➡️ 👩🏽‍🦽‍➡️ 👩🏾‍🤝‍👨🏻 👩🏾‍🤝‍👨🏼 👩🏾‍🤝‍👨🏽 👩🏾‍🤝‍👨🏿 👩🏾‍🤝‍👩🏻 👩🏾‍🤝‍👩🏼 👩🏾‍🤝‍👩🏽 👩🏾‍🤝‍👩🏿 👩🏾‍🦯‍➡️ 👩🏾‍🦼‍➡️ 👩🏾‍🦽‍➡️ 👩🏿‍🤝‍👨🏻 👩🏿‍🤝‍👨🏼 👩🏿‍🤝‍👨🏽 👩🏿‍🤝‍👨🏾 👩🏿‍🤝‍👩🏻 👩🏿‍🤝‍👩🏼 👩🏿‍🤝‍👩🏽 👩🏿‍🤝‍👩🏾 👩🏿‍🦯‍➡️ 👩🏿‍🦼‍➡️ 👩🏿‍🦽‍➡️ 🚶‍♀️‍➡️ 🚶‍♂️‍➡️ 🧎‍♀️‍➡️ 🧎‍♂️‍➡️ 🧑‍🧑‍🧒‍🧒 🧑🏻‍🤝‍🧑🏻 🧑🏻‍🤝‍🧑🏼 🧑🏻‍🤝‍🧑🏽 🧑🏻‍🤝‍🧑🏾 🧑🏻‍🤝‍🧑🏿 🧑🏻‍🦯‍➡️ 🧑🏻‍🦼‍➡️ 🧑🏻‍🦽‍➡️ 🧑🏼‍🤝‍🧑🏻 🧑🏼‍🤝‍🧑🏼 🧑🏼‍🤝‍🧑🏽 🧑🏼‍🤝‍🧑🏾 🧑🏼‍🤝‍🧑🏿 🧑🏼‍🦯‍➡️ 🧑🏼‍🦼‍➡️ 🧑🏼‍🦽‍➡️ 🧑🏽‍🤝‍🧑🏻 🧑🏽‍🤝‍🧑🏼 🧑🏽‍🤝‍🧑🏽 🧑🏽‍🤝‍🧑🏾 🧑🏽‍🤝‍🧑🏿 🧑🏽‍🦯‍➡️ 🧑🏽‍🦼‍➡️ 🧑🏽‍🦽‍➡️ 🧑🏾‍🤝‍🧑🏻 🧑🏾‍🤝‍🧑🏼 🧑🏾‍🤝‍🧑🏽 🧑🏾‍🤝‍🧑🏾 🧑🏾‍🤝‍🧑🏿 🧑🏾‍🦯‍➡️ 🧑🏾‍🦼‍➡️ 🧑🏾‍🦽‍➡️ 🧑🏿‍🤝‍🧑🏻 🧑🏿‍🤝‍🧑🏼 🧑🏿‍🤝‍🧑🏽 🧑🏿‍🤝‍🧑🏾 🧑🏿‍🤝‍🧑🏿 🧑🏿‍🦯‍➡️ 🧑🏿‍🦼‍➡️ 🧑🏿‍🦽‍➡️" .
        // 6 characters
        " 👨‍❤️‍👨 👨‍🦯‍➡️ 👨‍🦼‍➡️ 👨‍🦽‍➡️ 👩‍❤️‍👨 👩‍❤️‍👩 👩‍🦯‍➡️ 👩‍🦼‍➡️ 👩‍🦽‍➡️ 🧑‍🦯‍➡️ 🧑‍🦼‍➡️ 🧑‍🦽‍➡️" .
        // 5 characters
        " ⛹️‍♀️ ⛹️‍♂️ ⛹🏻‍♀️ ⛹🏻‍♂️ ⛹🏼‍♀️ ⛹🏼‍♂️ ⛹🏽‍♀️ ⛹🏽‍♂️ ⛹🏾‍♀️ ⛹🏾‍♂️ ⛹🏿‍♀️ ⛹🏿‍♂️ 🏃🏻‍♀️ 🏃🏻‍♂️ 🏃🏻‍➡️ 🏃🏼‍♀️ 🏃🏼‍♂️ 🏃🏼‍➡️ 🏃🏽‍♀️ 🏃🏽‍♂️ 🏃🏽‍➡️ 🏃🏾‍♀️ 🏃🏾‍♂️ 🏃🏾‍➡️ 🏃🏿‍♀️ 🏃🏿‍♂️ 🏃🏿‍➡️ 🏄🏻‍♀️ 🏄🏻‍♂️ 🏄🏼‍♀️ 🏄🏼‍♂️ 🏄🏽‍♀️ 🏄🏽‍♂️ 🏄🏾‍♀️ 🏄🏾‍♂️ 🏄🏿‍♀️ 🏄🏿‍♂️ 🏊🏻‍♀️ 🏊🏻‍♂️ 🏊🏼‍♀️ 🏊🏼‍♂️ 🏊🏽‍♀️ 🏊🏽‍♂️ 🏊🏾‍♀️ 🏊🏾‍♂️ 🏊🏿‍♀️ 🏊🏿‍♂️ 🏋️‍♀️ 🏋️‍♂️ 🏋🏻‍♀️ 🏋🏻‍♂️ 🏋🏼‍♀️ 🏋🏼‍♂️ 🏋🏽‍♀️ 🏋🏽‍♂️ 🏋🏾‍♀️ 🏋🏾‍♂️ 🏋🏿‍♀️ 🏋🏿‍♂️ 🏌️‍♀️ 🏌️‍♂️ 🏌🏻‍♀️ 🏌🏻‍♂️ 🏌🏼‍♀️ 🏌🏼‍♂️ 🏌🏽‍♀️ 🏌🏽‍♂️ 🏌🏾‍♀️ 🏌🏾‍♂️ 🏌🏿‍♀️ 🏌🏿‍♂️ 🏳️‍⚧️ 👁️‍🗨️ 👨‍👦‍👦 👨‍👧‍👦 👨‍👧‍👧 👨‍👨‍👦 👨‍👨‍👧 👨‍👩‍👦 👨‍👩‍👧 👨🏻‍⚕️ 👨🏻‍⚖️ 👨🏻‍✈️ 👨🏼‍⚕️ 👨🏼‍⚖️ 👨🏼‍✈️ 👨🏽‍⚕️ 👨🏽‍⚖️ 👨🏽‍✈️ 👨🏾‍⚕️ 👨🏾‍⚖️ 👨🏾‍✈️ 👨🏿‍⚕️ 👨🏿‍⚖️ 👨🏿‍✈️ 👩‍👦‍👦 👩‍👧‍👦 👩‍👧‍👧 👩‍👩‍👦 👩‍👩‍👧 👩🏻‍⚕️ 👩🏻‍⚖️ 👩🏻‍✈️ 👩🏼‍⚕️ 👩🏼‍⚖️ 👩🏼‍✈️ 👩🏽‍⚕️ 👩🏽‍⚖️ 👩🏽‍✈️ 👩🏾‍⚕️ 👩🏾‍⚖️ 👩🏾‍✈️ 👩🏿‍⚕️ 👩🏿‍⚖️ 👩🏿‍✈️ 👮🏻‍♀️ 👮🏻‍♂️ 👮🏼‍♀️ 👮🏼‍♂️ 👮🏽‍♀️ 👮🏽‍♂️ 👮🏾‍♀️ 👮🏾‍♂️ 👮🏿‍♀️ 👮🏿‍♂️ 👰🏻‍♀️ 👰🏻‍♂️ 👰🏼‍♀️ 👰🏼‍♂️ 👰🏽‍♀️ 👰🏽‍♂️ 👰🏾‍♀️ 👰🏾‍♂️ 👰🏿‍♀️ 👰🏿‍♂️ 👱🏻‍♀️ 👱🏻‍♂️ 👱🏼‍♀️ 👱🏼‍♂️ 👱🏽‍♀️ 👱🏽‍♂️ 👱🏾‍♀️ 👱🏾‍♂️ 👱🏿‍♀️ 👱🏿‍♂️ 👳🏻‍♀️ 👳🏻‍♂️ 👳🏼‍♀️ 👳🏼‍♂️ 👳🏽‍♀️ 👳🏽‍♂️ 👳🏾‍♀️ 👳🏾‍♂️ 👳🏿‍♀️ 👳🏿‍♂️ 👷🏻‍♀️ 👷🏻‍♂️ 👷🏼‍♀️ 👷🏼‍♂️ 👷🏽‍♀️ 👷🏽‍♂️ 👷🏾‍♀️ 👷🏾‍♂️ 👷🏿‍♀️ 👷🏿‍♂️ 💁🏻‍♀️ 💁🏻‍♂️ 💁🏼‍♀️ 💁🏼‍♂️ 💁🏽‍♀️ 💁🏽‍♂️ 💁🏾‍♀️ 💁🏾‍♂️ 💁🏿‍♀️ 💁🏿‍♂️ 💂🏻‍♀️ 💂🏻‍♂️ 💂🏼‍♀️ 💂🏼‍♂️ 💂🏽‍♀️ 💂🏽‍♂️ 💂🏾‍♀️ 💂🏾‍♂️ 💂🏿‍♀️ 💂🏿‍♂️ 💆🏻‍♀️ 💆🏻‍♂️ 💆🏼‍♀️ 💆🏼‍♂️ 💆🏽‍♀️ 💆🏽‍♂️ 💆🏾‍♀️ 💆🏾‍♂️ 💆🏿‍♀️ 💆🏿‍♂️ 💇🏻‍♀️ 💇🏻‍♂️ 💇🏼‍♀️ 💇🏼‍♂️ 💇🏽‍♀️ 💇🏽‍♂️ 💇🏾‍♀️ 💇🏾‍♂️ 💇🏿‍♀️ 💇🏿‍♂️ 🕵️‍♀️ 🕵️‍♂️ 🕵🏻‍♀️ 🕵🏻‍♂️ 🕵🏼‍♀️ 🕵🏼‍♂️ 🕵🏽‍♀️ 🕵🏽‍♂️ 🕵🏾‍♀️ 🕵🏾‍♂️ 🕵🏿‍♀️ 🕵🏿‍♂️ 🙅🏻‍♀️ 🙅🏻‍♂️ 🙅🏼‍♀️ 🙅🏼‍♂️ 🙅🏽‍♀️ 🙅🏽‍♂️ 🙅🏾‍♀️ 🙅🏾‍♂️ 🙅🏿‍♀️ 🙅🏿‍♂️ 🙆🏻‍♀️ 🙆🏻‍♂️ 🙆🏼‍♀️ 🙆🏼‍♂️ 🙆🏽‍♀️ 🙆🏽‍♂️ 🙆🏾‍♀️ 🙆🏾‍♂️ 🙆🏿‍♀️ 🙆🏿‍♂️ 🙇🏻‍♀️ 🙇🏻‍♂️ 🙇🏼‍♀️ 🙇🏼‍♂️ 🙇🏽‍♀️ 🙇🏽‍♂️ 🙇🏾‍♀️ 🙇🏾‍♂️ 🙇🏿‍♀️ 🙇🏿‍♂️ 🙋🏻‍♀️ 🙋🏻‍♂️ 🙋🏼‍♀️ 🙋🏼‍♂️ 🙋🏽‍♀️ 🙋🏽‍♂️ 🙋🏾‍♀️ 🙋🏾‍♂️ 🙋🏿‍♀️ 🙋🏿‍♂️ 🙍🏻‍♀️ 🙍🏻‍♂️ 🙍🏼‍♀️ 🙍🏼‍♂️ 🙍🏽‍♀️ 🙍🏽‍♂️ 🙍🏾‍♀️ 🙍🏾‍♂️ 🙍🏿‍♀️ 🙍🏿‍♂️ 🙎🏻‍♀️ 🙎🏻‍♂️ 🙎🏼‍♀️ 🙎🏼‍♂️ 🙎🏽‍♀️ 🙎🏽‍♂️ 🙎🏾‍♀️ 🙎🏾‍♂️ 🙎🏿‍♀️ 🙎🏿‍♂️ 🚣🏻‍♀️ 🚣🏻‍♂️ 🚣🏼‍♀️ 🚣🏼‍♂️ 🚣🏽‍♀️ 🚣🏽‍♂️ 🚣🏾‍♀️ 🚣🏾‍♂️ 🚣🏿‍♀️ 🚣🏿‍♂️ 🚴🏻‍♀️ 🚴🏻‍♂️ 🚴🏼‍♀️ 🚴🏼‍♂️ 🚴🏽‍♀️ 🚴🏽‍♂️ 🚴🏾‍♀️ 🚴🏾‍♂️ 🚴🏿‍♀️ 🚴🏿‍♂️ 🚵🏻‍♀️ 🚵🏻‍♂️ 🚵🏼‍♀️ 🚵🏼‍♂️ 🚵🏽‍♀️ 🚵🏽‍♂️ 🚵🏾‍♀️ 🚵🏾‍♂️ 🚵🏿‍♀️ 🚵🏿‍♂️ 🚶🏻‍♀️ 🚶🏻‍♂️ 🚶🏻‍➡️ 🚶🏼‍♀️ 🚶🏼‍♂️ 🚶🏼‍➡️ 🚶🏽‍♀️ 🚶🏽‍♂️ 🚶🏽‍➡️ 🚶🏾‍♀️ 🚶🏾‍♂️ 🚶🏾‍➡️ 🚶🏿‍♀️ 🚶🏿‍♂️ 🚶🏿‍➡️ 🤦🏻‍♀️ 🤦🏻‍♂️ 🤦🏼‍♀️ 🤦🏼‍♂️ 🤦🏽‍♀️ 🤦🏽‍♂️ 🤦🏾‍♀️ 🤦🏾‍♂️ 🤦🏿‍♀️ 🤦🏿‍♂️ 🤵🏻‍♀️ 🤵🏻‍♂️ 🤵🏼‍♀️ 🤵🏼‍♂️ 🤵🏽‍♀️ 🤵🏽‍♂️ 🤵🏾‍♀️ 🤵🏾‍♂️ 🤵🏿‍♀️ 🤵🏿‍♂️ 🤷🏻‍♀️ 🤷🏻‍♂️ 🤷🏼‍♀️ 🤷🏼‍♂️ 🤷🏽‍♀️ 🤷🏽‍♂️ 🤷🏾‍♀️ 🤷🏾‍♂️ 🤷🏿‍♀️ 🤷🏿‍♂️ 🤸🏻‍♀️ 🤸🏻‍♂️ 🤸🏼‍♀️ 🤸🏼‍♂️ 🤸🏽‍♀️ 🤸🏽‍♂️ 🤸🏾‍♀️ 🤸🏾‍♂️ 🤸🏿‍♀️ 🤸🏿‍♂️ 🤹🏻‍♀️ 🤹🏻‍♂️ 🤹🏼‍♀️ 🤹🏼‍♂️ 🤹🏽‍♀️ 🤹🏽‍♂️ 🤹🏾‍♀️ 🤹🏾‍♂️ 🤹🏿‍♀️ 🤹🏿‍♂️ 🤽🏻‍♀️ 🤽🏻‍♂️ 🤽🏼‍♀️ 🤽🏼‍♂️ 🤽🏽‍♀️ 🤽🏽‍♂️ 🤽🏾‍♀️ 🤽🏾‍♂️ 🤽🏿‍♀️ 🤽🏿‍♂️ 🤾🏻‍♀️ 🤾🏻‍♂️ 🤾🏼‍♀️ 🤾🏼‍♂️ 🤾🏽‍♀️ 🤾🏽‍♂️ 🤾🏾‍♀️ 🤾🏾‍♂️ 🤾🏿‍♀️ 🤾🏿‍♂️ 🦸🏻‍♀️ 🦸🏻‍♂️ 🦸🏼‍♀️ 🦸🏼‍♂️ 🦸🏽‍♀️ 🦸🏽‍♂️ 🦸🏾‍♀️ 🦸🏾‍♂️ 🦸🏿‍♀️ 🦸🏿‍♂️ 🦹🏻‍♀️ 🦹🏻‍♂️ 🦹🏼‍♀️ 🦹🏼‍♂️ 🦹🏽‍♀️ 🦹🏽‍♂️ 🦹🏾‍♀️ 🦹🏾‍♂️ 🦹🏿‍♀️ 🦹🏿‍♂️ 🧍🏻‍♀️ 🧍🏻‍♂️ 🧍🏼‍♀️ 🧍🏼‍♂️ 🧍🏽‍♀️ 🧍🏽‍♂️ 🧍🏾‍♀️ 🧍🏾‍♂️ 🧍🏿‍♀️ 🧍🏿‍♂️ 🧎🏻‍♀️ 🧎🏻‍♂️ 🧎🏻‍➡️ 🧎🏼‍♀️ 🧎🏼‍♂️ 🧎🏼‍➡️ 🧎🏽‍♀️ 🧎🏽‍♂️ 🧎🏽‍➡️ 🧎🏾‍♀️ 🧎🏾‍♂️ 🧎🏾‍➡️ 🧎🏿‍♀️ 🧎🏿‍♂️ 🧎🏿‍➡️ 🧏🏻‍♀️ 🧏🏻‍♂️ 🧏🏼‍♀️ 🧏🏼‍♂️ 🧏🏽‍♀️ 🧏🏽‍♂️ 🧏🏾‍♀️ 🧏🏾‍♂️ 🧏🏿‍♀️ 🧏🏿‍♂️ 🧑‍🤝‍🧑 🧑‍🧑‍🧒 🧑‍🧒‍🧒 🧑🏻‍⚕️ 🧑🏻‍⚖️ 🧑🏻‍✈️ 🧑🏼‍⚕️ 🧑🏼‍⚖️ 🧑🏼‍✈️ 🧑🏽‍⚕️ 🧑🏽‍⚖️ 🧑🏽‍✈️ 🧑🏾‍⚕️ 🧑🏾‍⚖️ 🧑🏾‍✈️ 🧑🏿‍⚕️ 🧑🏿‍⚖️ 🧑🏿‍✈️ 🧔🏻‍♀️ 🧔🏻‍♂️ 🧔🏼‍♀️ 🧔🏼‍♂️ 🧔🏽‍♀️ 🧔🏽‍♂️ 🧔🏾‍♀️ 🧔🏾‍♂️ 🧔🏿‍♀️ 🧔🏿‍♂️ 🧖🏻‍♀️ 🧖🏻‍♂️ 🧖🏼‍♀️ 🧖🏼‍♂️ 🧖🏽‍♀️ 🧖🏽‍♂️ 🧖🏾‍♀️ 🧖🏾‍♂️ 🧖🏿‍♀️ 🧖🏿‍♂️ 🧗🏻‍♀️ 🧗🏻‍♂️ 🧗🏼‍♀️ 🧗🏼‍♂️ 🧗🏽‍♀️ 🧗🏽‍♂️ 🧗🏾‍♀️ 🧗🏾‍♂️ 🧗🏿‍♀️ 🧗🏿‍♂️ 🧘🏻‍♀️ 🧘🏻‍♂️ 🧘🏼‍♀️ 🧘🏼‍♂️ 🧘🏽‍♀️ 🧘🏽‍♂️ 🧘🏾‍♀️ 🧘🏾‍♂️ 🧘🏿‍♀️ 🧘🏿‍♂️ 🧙🏻‍♀️ 🧙🏻‍♂️ 🧙🏼‍♀️ 🧙🏼‍♂️ 🧙🏽‍♀️ 🧙🏽‍♂️ 🧙🏾‍♀️ 🧙🏾‍♂️ 🧙🏿‍♀️ 🧙🏿‍♂️ 🧚🏻‍♀️ 🧚🏻‍♂️ 🧚🏼‍♀️ 🧚🏼‍♂️ 🧚🏽‍♀️ 🧚🏽‍♂️ 🧚🏾‍♀️ 🧚🏾‍♂️ 🧚🏿‍♀️ 🧚🏿‍♂️ 🧛🏻‍♀️ 🧛🏻‍♂️ 🧛🏼‍♀️ 🧛🏼‍♂️ 🧛🏽‍♀️ 🧛🏽‍♂️ 🧛🏾‍♀️ 🧛🏾‍♂️ 🧛🏿‍♀️ 🧛🏿‍♂️ 🧜🏻‍♀️ 🧜🏻‍♂️ 🧜🏼‍♀️ 🧜🏼‍♂️ 🧜🏽‍♀️ 🧜🏽‍♂️ 🧜🏾‍♀️ 🧜🏾‍♂️ 🧜🏿‍♀️ 🧜🏿‍♂️ 🧝🏻‍♀️ 🧝🏻‍♂️ 🧝🏼‍♀️ 🧝🏼‍♂️ 🧝🏽‍♀️ 🧝🏽‍♂️ 🧝🏾‍♀️ 🧝🏾‍♂️ 🧝🏿‍♀️ 🧝🏿‍♂️ 🫱🏻‍🫲🏼 🫱🏻‍🫲🏽 🫱🏻‍🫲🏾 🫱🏻‍🫲🏿 🫱🏼‍🫲🏻 🫱🏼‍🫲🏽 🫱🏼‍🫲🏾 🫱🏼‍🫲🏿 🫱🏽‍🫲🏻 🫱🏽‍🫲🏼 🫱🏽‍🫲🏾 🫱🏽‍🫲🏿 🫱🏾‍🫲🏻 🫱🏾‍🫲🏼 🫱🏾‍🫲🏽 🫱🏾‍🫲🏿 🫱🏿‍🫲🏻 🫱🏿‍🫲🏼 🫱🏿‍🫲🏽 🫱🏿‍🫲🏾" .
        " 🏄️‍♀️ 🏄️‍♂️ 🏊️‍♀️ 🏊️‍♂️ 👨🏻‍🎓️ 👨🏻‍🏭️ 👨🏻‍💻️ 👨🏼‍🎓️ 👨🏼‍🏭️ 👨🏼‍💻️ 👨🏽‍🎓️ 👨🏽‍🏭️ 👨🏽‍💻️ 👨🏾‍🎓️ 👨🏾‍🏭️ 👨🏾‍💻️ 👨🏿‍🎓️ 👨🏿‍🏭️ 👨🏿‍💻️ 👩🏻‍🎓️ 👩🏻‍🏭️ 👩🏻‍💻️ 👩🏼‍🎓️ 👩🏼‍🏭️ 👩🏼‍💻️ 👩🏽‍🎓️ 👩🏽‍🏭️ 👩🏽‍💻️ 👩🏾‍🎓️ 👩🏾‍🏭️ 👩🏾‍💻️ 👩🏿‍🎓️ 👩🏿‍🏭️ 👩🏿‍💻️ 🧑🏻‍🎓️ 🧑🏻‍🏭️ 🧑🏻‍💻️ 🧑🏼‍🎓️ 🧑🏼‍🏭️ 🧑🏼‍💻️ 🧑🏽‍🎓️ 🧑🏽‍🏭️ 🧑🏽‍💻️ 🧑🏾‍🎓️ 🧑🏾‍🏭️ 🧑🏾‍💻️ 🧑🏿‍🎓️ 🧑🏿‍🏭️ 🧑🏿‍💻️" .
        " 🐈️‍⬛️ 🐦️‍⬛️" .
        // 4 characters
        " ⛓️‍💥 ❤️‍🔥 ❤️‍🩹 🏃‍♀️ 🏃‍♂️ 🏃‍➡️ 🏳️‍🌈 🏴‍☠️ 🐻‍❄️ 👨‍⚕️ 👨‍⚖️ 👨‍✈️ 👨🏻‍🌾 👨🏻‍🍳 👨🏻‍🍼 👨🏻‍🎤 👨🏻‍🎨 👨🏻‍🏫 👨🏻‍💼 👨🏻‍🔧 👨🏻‍🔬 👨🏻‍🚀 👨🏻‍🚒 👨🏻‍🦯 👨🏻‍🦰 👨🏻‍🦱 👨🏻‍🦲 👨🏻‍🦳 👨🏻‍🦼 👨🏻‍🦽 👨🏼‍🌾 👨🏼‍🍳 👨🏼‍🍼 👨🏼‍🎤 👨🏼‍🎨 👨🏼‍🏫 👨🏼‍💼 👨🏼‍🔧 👨🏼‍🔬 👨🏼‍🚀 👨🏼‍🚒 👨🏼‍🦯 👨🏼‍🦰 👨🏼‍🦱 👨🏼‍🦲 👨🏼‍🦳 👨🏼‍🦼 👨🏼‍🦽 👨🏽‍🌾 👨🏽‍🍳 👨🏽‍🍼 👨🏽‍🎤 👨🏽‍🎨 👨🏽‍🏫 👨🏽‍💼 👨🏽‍🔧 👨🏽‍🔬 👨🏽‍🚀 👨🏽‍🚒 👨🏽‍🦯 👨🏽‍🦰 👨🏽‍🦱 👨🏽‍🦲 👨🏽‍🦳 👨🏽‍🦼 👨🏽‍🦽 👨🏾‍🌾 👨🏾‍🍳 👨🏾‍🍼 👨🏾‍🎤 👨🏾‍🎨 👨🏾‍🏫 👨🏾‍💼 👨🏾‍🔧 👨🏾‍🔬 👨🏾‍🚀 👨🏾‍🚒 👨🏾‍🦯 👨🏾‍🦰 👨🏾‍🦱 👨🏾‍🦲 👨🏾‍🦳 👨🏾‍🦼 👨🏾‍🦽 👨🏿‍🌾 👨🏿‍🍳 👨🏿‍🍼 👨🏿‍🎤 👨🏿‍🎨 👨🏿‍🏫 👨🏿‍💼 👨🏿‍🔧 👨🏿‍🔬 👨🏿‍🚀 👨🏿‍🚒 👨🏿‍🦯 👨🏿‍🦰 👨🏿‍🦱 👨🏿‍🦲 👨🏿‍🦳 👨🏿‍🦼 👨🏿‍🦽 👩‍⚕️ 👩‍⚖️ 👩‍✈️ 👩🏻‍🌾 👩🏻‍🍳 👩🏻‍🍼 👩🏻‍🎤 👩🏻‍🎨 👩🏻‍🏫 👩🏻‍💼 👩🏻‍🔧 👩🏻‍🔬 👩🏻‍🚀 👩🏻‍🚒 👩🏻‍🦯 👩🏻‍🦰 👩🏻‍🦱 👩🏻‍🦲 👩🏻‍🦳 👩🏻‍🦼 👩🏻‍🦽 👩🏼‍🌾 👩🏼‍🍳 👩🏼‍🍼 👩🏼‍🎤 👩🏼‍🎨 👩🏼‍🏫 👩🏼‍💼 👩🏼‍🔧 👩🏼‍🔬 👩🏼‍🚀 👩🏼‍🚒 👩🏼‍🦯 👩🏼‍🦰 👩🏼‍🦱 👩🏼‍🦲 👩🏼‍🦳 👩🏼‍🦼 👩🏼‍🦽 👩🏽‍🌾 👩🏽‍🍳 👩🏽‍🍼 👩🏽‍🎤 👩🏽‍🎨 👩🏽‍🏫 👩🏽‍💼 👩🏽‍🔧 👩🏽‍🔬 👩🏽‍🚀 👩🏽‍🚒 👩🏽‍🦯 👩🏽‍🦰 👩🏽‍🦱 👩🏽‍🦲 👩🏽‍🦳 👩🏽‍🦼 👩🏽‍🦽 👩🏾‍🌾 👩🏾‍🍳 👩🏾‍🍼 👩🏾‍🎤 👩🏾‍🎨 👩🏾‍🏫 👩🏾‍💼 👩🏾‍🔧 👩🏾‍🔬 👩🏾‍🚀 👩🏾‍🚒 👩🏾‍🦯 👩🏾‍🦰 👩🏾‍🦱 👩🏾‍🦲 👩🏾‍🦳 👩🏾‍🦼 👩🏾‍🦽 👩🏿‍🌾 👩🏿‍🍳 👩🏿‍🍼 👩🏿‍🎤 👩🏿‍🎨 👩🏿‍🏫 👩🏿‍💼 👩🏿‍🔧 👩🏿‍🔬 👩🏿‍🚀 👩🏿‍🚒 👩🏿‍🦯 👩🏿‍🦰 👩🏿‍🦱 👩🏿‍🦲 👩🏿‍🦳 👩🏿‍🦼 👩🏿‍🦽 👮‍♀️ 👮‍♂️ 👯‍♀️ 👯‍♂️ 👰‍♀️ 👰‍♂️ 👱‍♀️ 👱‍♂️ 👳‍♀️ 👳‍♂️ 👷‍♀️ 👷‍♂️ 💁‍♀️ 💁‍♂️ 💂‍♀️ 💂‍♂️ 💆‍♀️ 💆‍♂️ 💇‍♀️ 💇‍♂️ 😶‍🌫️ 🙂‍↔️ 🙂‍↕️ 🙅‍♀️ 🙅‍♂️ 🙆‍♀️ 🙆‍♂️ 🙇‍♀️ 🙇‍♂️ 🙋‍♀️ 🙋‍♂️ 🙍‍♀️ 🙍‍♂️ 🙎‍♀️ 🙎‍♂️ 🚣‍♀️ 🚣‍♂️ 🚴‍♀️ 🚴‍♂️ 🚵‍♀️ 🚵‍♂️ 🚶‍♀️ 🚶‍♂️ 🚶‍➡️ 🤦‍♀️ 🤦‍♂️ 🤵‍♀️ 🤵‍♂️ 🤷‍♀️ 🤷‍♂️ 🤸‍♀️ 🤸‍♂️ 🤹‍♀️ 🤹‍♂️ 🤼‍♀️ 🤼‍♂️ 🤽‍♀️ 🤽‍♂️ 🤾‍♀️ 🤾‍♂️ 🦸‍♀️ 🦸‍♂️ 🦹‍♀️ 🦹‍♂️ 🧍‍♀️ 🧍‍♂️ 🧎‍♀️ 🧎‍♂️ 🧎‍➡️ 🧏‍♀️ 🧏‍♂️ 🧑‍⚕️ 🧑‍⚖️ 🧑‍✈️ 🧑🏻‍🌾 🧑🏻‍🍳 🧑🏻‍🍼 🧑🏻‍🎄 🧑🏻‍🎤 🧑🏻‍🎨 🧑🏻‍🏫 🧑🏻‍💼 🧑🏻‍🔧 🧑🏻‍🔬 🧑🏻‍🚀 🧑🏻‍🚒 🧑🏻‍🦯 🧑🏻‍🦰 🧑🏻‍🦱 🧑🏻‍🦲 🧑🏻‍🦳 🧑🏻‍🦼 🧑🏻‍🦽 🧑🏼‍🌾 🧑🏼‍🍳 🧑🏼‍🍼 🧑🏼‍🎄 🧑🏼‍🎤 🧑🏼‍🎨 🧑🏼‍🏫 🧑🏼‍💼 🧑🏼‍🔧 🧑🏼‍🔬 🧑🏼‍🚀 🧑🏼‍🚒 🧑🏼‍🦯 🧑🏼‍🦰 🧑🏼‍🦱 🧑🏼‍🦲 🧑🏼‍🦳 🧑🏼‍🦼 🧑🏼‍🦽 🧑🏽‍🌾 🧑🏽‍🍳 🧑🏽‍🍼 🧑🏽‍🎄 🧑🏽‍🎤 🧑🏽‍🎨 🧑🏽‍🏫 🧑🏽‍💼 🧑🏽‍🔧 🧑🏽‍🔬 🧑🏽‍🚀 🧑🏽‍🚒 🧑🏽‍🦯 🧑🏽‍🦰 🧑🏽‍🦱 🧑🏽‍🦲 🧑🏽‍🦳 🧑🏽‍🦼 🧑🏽‍🦽 🧑🏾‍🌾 🧑🏾‍🍳 🧑🏾‍🍼 🧑🏾‍🎄 🧑🏾‍🎤 🧑🏾‍🎨 🧑🏾‍🏫 🧑🏾‍💼 🧑🏾‍🔧 🧑🏾‍🔬 🧑🏾‍🚀 🧑🏾‍🚒 🧑🏾‍🦯 🧑🏾‍🦰 🧑🏾‍🦱 🧑🏾‍🦲 🧑🏾‍🦳 🧑🏾‍🦼 🧑🏾‍🦽 🧑🏿‍🌾 🧑🏿‍🍳 🧑🏿‍🍼 🧑🏿‍🎄 🧑🏿‍🎤 🧑🏿‍🎨 🧑🏿‍🏫 🧑🏿‍💼 🧑🏿‍🔧 🧑🏿‍🔬 🧑🏿‍🚀 🧑🏿‍🚒 🧑🏿‍🦯 🧑🏿‍🦰 🧑🏿‍🦱 🧑🏿‍🦲 🧑🏿‍🦳 🧑🏿‍🦼 🧑🏿‍🦽 🧔‍♀️ 🧔‍♂️ 🧖‍♀️ 🧖‍♂️ 🧗‍♀️ 🧗‍♂️ 🧘‍♀️ 🧘‍♂️ 🧙‍♀️ 🧙‍♂️ 🧚‍♀️ 🧚‍♂️ 🧛‍♀️ 🧛‍♂️ 🧜‍♀️ 🧜‍♂️ 🧝‍♀️ 🧝‍♂️ 🧞‍♀️ 🧞‍♂️ 🧟‍♀️ 🧟‍♂️" .
        " 🐕️‍🦺 🐦️‍🔥 👨‍🎓️ 👨‍🏭️ 👨‍💻️ 👩‍🎓️ 👩‍🏭️ 👩‍💻️ 🧑‍🎓️ 🧑‍🏭️ 🧑‍💻️" .
        // 3 characters
        " #️⃣ *️⃣ 0️⃣ 1️⃣ 2️⃣ 3️⃣ 4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🍄‍🟫 🍋‍🟩 👨‍🌾 👨‍🍳 👨‍🍼 👨‍🎤 👨‍🎨 👨‍🏫 👨‍👦 👨‍👧 👨‍💼 👨‍🔧 👨‍🔬 👨‍🚀 👨‍🚒 👨‍🦯 👨‍🦰 👨‍🦱 👨‍🦲 👨‍🦳 👨‍🦼 👨‍🦽 👩‍🌾 👩‍🍳 👩‍🍼 👩‍🎤 👩‍🎨 👩‍🏫 👩‍👦 👩‍👧 👩‍💼 👩‍🔧 👩‍🔬 👩‍🚀 👩‍🚒 👩‍🦯 👩‍🦰 👩‍🦱 👩‍🦲 👩‍🦳 👩‍🦼 👩‍🦽 😮‍💨 😵‍💫 🧑‍🌾 🧑‍🍳 🧑‍🍼 🧑‍🎄 🧑‍🎤 🧑‍🎨 🧑‍🏫 🧑‍💼 🧑‍🔧 🧑‍🔬 🧑‍🚀 🧑‍🚒 🧑‍🦯 🧑‍🦰 🧑‍🦱 🧑‍🦲 🧑‍🦳 🧑‍🦼 🧑‍🦽 🧑‍🧒" .
        // 2 characters
        " ©️ ®️ ‼️ ⁉️ ™️ ℹ️ ↔️ ↕️ ↖️ ↗️ ↘️ ↙️ ↩️ ↪️ ⌨️ ⏏️ ⏭️ ⏮️ ⏯️ ⏱️ ⏲️ ⏸️ ⏹️ ⏺️ Ⓜ️ ▪️ ▫️ ▶️ ◀️ ◻️ ◼️ ☀️ ☁️ ☂️ ☃️ ☄️ ☎️ ☑️ ☘️ ☝️ ☝🏻 ☝🏼 ☝🏽 ☝🏾 ☝🏿 ☠️ ☢️ ☣️ ☦️ ☪️ ☮️ ☯️ ☸️ ☹️ ☺️ ♀️ ♂️ ♟️ ♠️ ♣️ ♥️ ♦️ ♨️ ♻️ ♾️ ⚒️ ⚔️ ⚕️ ⚖️ ⚗️ ⚙️ ⚛️ ⚜️ ⚠️ ⚧️ ⚰️ ⚱️ ⛈️ ⛏️ ⛑️ ⛓️ ⛩️ ⛰️ ⛱️ ⛴️ ⛷️ ⛸️ ⛹️ ⛹🏻 ⛹🏼 ⛹🏽 ⛹🏾 ⛹🏿 ✂️ ✈️ ✉️ ✊🏻 ✊🏼 ✊🏽 ✊🏾 ✊🏿 ✋🏻 ✋🏼 ✋🏽 ✋🏾 ✋🏿 ✌️ ✌🏻 ✌🏼 ✌🏽 ✌🏾 ✌🏿 ✍️ ✍🏻 ✍🏼 ✍🏽 ✍🏾 ✍🏿 ✏️ ✒️ ✔️ ✖️ ✝️ ✡️ ✳️ ✴️ ❄️ ❇️ ❣️ ❤️ ➡️ ⤴️ ⤵️ ⬅️ ⬆️ ⬇️ 〰️ 〽️ ㊗️ ㊙️ 🅰️ 🅱️ 🅾️ 🅿️ 🇦🇨 🇦🇩 🇦🇪 🇦🇫 🇦🇬 🇦🇮 🇦🇱 🇦🇲 🇦🇴 🇦🇶 🇦🇷 🇦🇸 🇦🇹 🇦🇺 🇦🇼 🇦🇽 🇦🇿 🇧🇦 🇧🇧 🇧🇩 🇧🇪 🇧🇫 🇧🇬 🇧🇭 🇧🇮 🇧🇯 🇧🇱 🇧🇲 🇧🇳 🇧🇴 🇧🇶 🇧🇷 🇧🇸 🇧🇹 🇧🇻 🇧🇼 🇧🇾 🇧🇿 🇨🇦 🇨🇨 🇨🇩 🇨🇫 🇨🇬 🇨🇭 🇨🇮 🇨🇰 🇨🇱 🇨🇲 🇨🇳 🇨🇴 🇨🇵 🇨🇶 🇨🇷 🇨🇺 🇨🇻 🇨🇼 🇨🇽 🇨🇾 🇨🇿 🇩🇪 🇩🇬 🇩🇯 🇩🇰 🇩🇲 🇩🇴 🇩🇿 🇪🇦 🇪🇨 🇪🇪 🇪🇬 🇪🇭 🇪🇷 🇪🇸 🇪🇹 🇪🇺 🇫🇮 🇫🇯 🇫🇰 🇫🇲 🇫🇴 🇫🇷 🇬🇦 🇬🇧 🇬🇩 🇬🇪 🇬🇫 🇬🇬 🇬🇭 🇬🇮 🇬🇱 🇬🇲 🇬🇳 🇬🇵 🇬🇶 🇬🇷 🇬🇸 🇬🇹 🇬🇺 🇬🇼 🇬🇾 🇭🇰 🇭🇲 🇭🇳 🇭🇷 🇭🇹 🇭🇺 🇮🇨 🇮🇩 🇮🇪 🇮🇱 🇮🇲 🇮🇳 🇮🇴 🇮🇶 🇮🇷 🇮🇸 🇮🇹 🇯🇪 🇯🇲 🇯🇴 🇯🇵 🇰🇪 🇰🇬 🇰🇭 🇰🇮 🇰🇲 🇰🇳 🇰🇵 🇰🇷 🇰🇼 🇰🇾 🇰🇿 🇱🇦 🇱🇧 🇱🇨 🇱🇮 🇱🇰 🇱🇷 🇱🇸 🇱🇹 🇱🇺 🇱🇻 🇱🇾 🇲🇦 🇲🇨 🇲🇩 🇲🇪 🇲🇫 🇲🇬 🇲🇭 🇲🇰 🇲🇱 🇲🇲 🇲🇳 🇲🇴 🇲🇵 🇲🇶 🇲🇷 🇲🇸 🇲🇹 🇲🇺 🇲🇻 🇲🇼 🇲🇽 🇲🇾 🇲🇿 🇳🇦 🇳🇨 🇳🇪 🇳🇫 🇳🇬 🇳🇮 🇳🇱 🇳🇴 🇳🇵 🇳🇷 🇳🇺 🇳🇿 🇴🇲 🇵🇦 🇵🇪 🇵🇫 🇵🇬 🇵🇭 🇵🇰 🇵🇱 🇵🇲 🇵🇳 🇵🇷 🇵🇸 🇵🇹 🇵🇼 🇵🇾 🇶🇦 🇷🇪 🇷🇴 🇷🇸 🇷🇺 🇷🇼 🇸🇦 🇸🇧 🇸🇨 🇸🇩 🇸🇪 🇸🇬 🇸🇭 🇸🇮 🇸🇯 🇸🇰 🇸🇱 🇸🇲 🇸🇳 🇸🇴 🇸🇷 🇸🇸 🇸🇹 🇸🇻 🇸🇽 🇸🇾 🇸🇿 🇹🇦 🇹🇨 🇹🇩 🇹🇫 🇹🇬 🇹🇭 🇹🇯 🇹🇰 🇹🇱 🇹🇲 🇹🇳 🇹🇴 🇹🇷 🇹🇹 🇹🇻 🇹🇼 🇹🇿 🇺🇦 🇺🇬 🇺🇲 🇺🇳 🇺🇸 🇺🇾 🇺🇿 🇻🇦 🇻🇨 🇻🇪 🇻🇬 🇻🇮 🇻🇳 🇻🇺 🇼🇫 🇼🇸 🇽🇰 🇾🇪 🇾🇹 🇿🇦 🇿🇲 🇿🇼 🈂️ 🈷️ 🌡️ 🌤️ 🌥️ 🌦️ 🌧️ 🌨️ 🌩️ 🌪️ 🌫️ 🌬️ 🌶️ 🍽️ 🎅🏻 🎅🏼 🎅🏽 🎅🏾 🎅🏿 🎖️ 🎗️ 🎙️ 🎚️ 🎛️ 🎞️ 🎟️ 🏂🏻 🏂🏼 🏂🏽 🏂🏾 🏂🏿 🏃🏻 🏃🏼 🏃🏽 🏃🏾 🏃🏿 🏄🏻 🏄🏼 🏄🏽 🏄🏾 🏄🏿 🏇🏻 🏇🏼 🏇🏽 🏇🏾 🏇🏿 🏊🏻 🏊🏼 🏊🏽 🏊🏾 🏊🏿 🏋️ 🏋🏻 🏋🏼 🏋🏽 🏋🏾 🏋🏿 🏌️ 🏌🏻 🏌🏼 🏌🏽 🏌🏾 🏌🏿 🏍️ 🏎️ 🏔️ 🏕️ 🏖️ 🏗️ 🏘️ 🏙️ 🏚️ 🏛️ 🏜️ 🏝️ 🏞️ 🏟️ 🏳️ 🏵️ 🏷️ 🐿️ 👁️ 👂🏻 👂🏼 👂🏽 👂🏾 👂🏿 👃🏻 👃🏼 👃🏽 👃🏾 👃🏿 👆🏻 👆🏼 👆🏽 👆🏾 👆🏿 👇🏻 👇🏼 👇🏽 👇🏾 👇🏿 👈🏻 👈🏼 👈🏽 👈🏾 👈🏿 👉🏻 👉🏼 👉🏽 👉🏾 👉🏿 👊🏻 👊🏼 👊🏽 👊🏾 👊🏿 👋🏻 👋🏼 👋🏽 👋🏾 👋🏿 👌🏻 👌🏼 👌🏽 👌🏾 👌🏿 👍🏻 👍🏼 👍🏽 👍🏾 👍🏿 👎🏻 👎🏼 👎🏽 👎🏾 👎🏿 👏🏻 👏🏼 👏🏽 👏🏾 👏🏿 👐🏻 👐🏼 👐🏽 👐🏾 👐🏿 👦🏻 👦🏼 👦🏽 👦🏾 👦🏿 👧🏻 👧🏼 👧🏽 👧🏾 👧🏿 👨🏻 👨🏼 👨🏽 👨🏾 👨🏿 👩🏻 👩🏼 👩🏽 👩🏾 👩🏿 👫🏻 👫🏼 👫🏽 👫🏾 👫🏿 👬🏻 👬🏼 👬🏽 👬🏾 👬🏿 👭🏻 👭🏼 👭🏽 👭🏾 👭🏿 👮🏻 👮🏼 👮🏽 👮🏾 👮🏿 👰🏻 👰🏼 👰🏽 👰🏾 👰🏿 👱🏻 👱🏼 👱🏽 👱🏾 👱🏿 👲🏻 👲🏼 👲🏽 👲🏾 👲🏿 👳🏻 👳🏼 👳🏽 👳🏾 👳🏿 👴🏻 👴🏼 👴🏽 👴🏾 👴🏿 👵🏻 👵🏼 👵🏽 👵🏾 👵🏿 👶🏻 👶🏼 👶🏽 👶🏾 👶🏿 👷🏻 👷🏼 👷🏽 👷🏾 👷🏿 👸🏻 👸🏼 👸🏽 👸🏾 👸🏿 👼🏻 👼🏼 👼🏽 👼🏾 👼🏿 💁🏻 💁🏼 💁🏽 💁🏾 💁🏿 💂🏻 💂🏼 💂🏽 💂🏾 💂🏿 💃🏻 💃🏼 💃🏽 💃🏾 💃🏿 💅🏻 💅🏼 💅🏽 💅🏾 💅🏿 💆🏻 💆🏼 💆🏽 💆🏾 💆🏿 💇🏻 💇🏼 💇🏽 💇🏾 💇🏿 💏🏻 💏🏼 💏🏽 💏🏾 💏🏿 💑🏻 💑🏼 💑🏽 💑🏾 💑🏿 💪🏻 💪🏼 💪🏽 💪🏾 💪🏿 📽️ 🕉️ 🕊️ 🕯️ 🕰️ 🕳️ 🕴️ 🕴🏻 🕴🏼 🕴🏽 🕴🏾 🕴🏿 🕵️ 🕵🏻 🕵🏼 🕵🏽 🕵🏾 🕵🏿 🕶️ 🕷️ 🕸️ 🕹️ 🕺🏻 🕺🏼 🕺🏽 🕺🏾 🕺🏿 🖇️ 🖊️ 🖋️ 🖌️ 🖍️ 🖐️ 🖐🏻 🖐🏼 🖐🏽 🖐🏾 🖐🏿 🖕🏻 🖕🏼 🖕🏽 🖕🏾 🖕🏿 🖖🏻 🖖🏼 🖖🏽 🖖🏾 🖖🏿 🖥️ 🖨️ 🖱️ 🖲️ 🖼️ 🗂️ 🗃️ 🗄️ 🗑️ 🗒️ 🗓️ 🗜️ 🗝️ 🗞️ 🗡️ 🗣️ 🗨️ 🗯️ 🗳️ 🗺️ 🙅🏻 🙅🏼 🙅🏽 🙅🏾 🙅🏿 🙆🏻 🙆🏼 🙆🏽 🙆🏾 🙆🏿 🙇🏻 🙇🏼 🙇🏽 🙇🏾 🙇🏿 🙋🏻 🙋🏼 🙋🏽 🙋🏾 🙋🏿 🙌🏻 🙌🏼 🙌🏽 🙌🏾 🙌🏿 🙍🏻 🙍🏼 🙍🏽 🙍🏾 🙍🏿 🙎🏻 🙎🏼 🙎🏽 🙎🏾 🙎🏿 🙏🏻 🙏🏼 🙏🏽 🙏🏾 🙏🏿 🚣🏻 🚣🏼 🚣🏽 🚣🏾 🚣🏿 🚴🏻 🚴🏼 🚴🏽 🚴🏾 🚴🏿 🚵🏻 🚵🏼 🚵🏽 🚵🏾 🚵🏿 🚶🏻 🚶🏼 🚶🏽 🚶🏾 🚶🏿 🛀🏻 🛀🏼 🛀🏽 🛀🏾 🛀🏿 🛋️ 🛌🏻 🛌🏼 🛌🏽 🛌🏾 🛌🏿 🛍️ 🛎️ 🛏️ 🛠️ 🛡️ 🛢️ 🛣️ 🛤️ 🛥️ 🛩️ 🛰️ 🛳️ 🤌🏻 🤌🏼 🤌🏽 🤌🏾 🤌🏿 🤏🏻 🤏🏼 🤏🏽 🤏🏾 🤏🏿 🤘🏻 🤘🏼 🤘🏽 🤘🏾 🤘🏿 🤙🏻 🤙🏼 🤙🏽 🤙🏾 🤙🏿 🤚🏻 🤚🏼 🤚🏽 🤚🏾 🤚🏿 🤛🏻 🤛🏼 🤛🏽 🤛🏾 🤛🏿 🤜🏻 🤜🏼 🤜🏽 🤜🏾 🤜🏿 🤝🏻 🤝🏼 🤝🏽 🤝🏾 🤝🏿 🤞🏻 🤞🏼 🤞🏽 🤞🏾 🤞🏿 🤟🏻 🤟🏼 🤟🏽 🤟🏾 🤟🏿 🤦🏻 🤦🏼 🤦🏽 🤦🏾 🤦🏿 🤰🏻 🤰🏼 🤰🏽 🤰🏾 🤰🏿 🤱🏻 🤱🏼 🤱🏽 🤱🏾 🤱🏿 🤲🏻 🤲🏼 🤲🏽 🤲🏾 🤲🏿 🤳🏻 🤳🏼 🤳🏽 🤳🏾 🤳🏿 🤴🏻 🤴🏼 🤴🏽 🤴🏾 🤴🏿 🤵🏻 🤵🏼 🤵🏽 🤵🏾 🤵🏿 🤶🏻 🤶🏼 🤶🏽 🤶🏾 🤶🏿 🤷🏻 🤷🏼 🤷🏽 🤷🏾 🤷🏿 🤸🏻 🤸🏼 🤸🏽 🤸🏾 🤸🏿 🤹🏻 🤹🏼 🤹🏽 🤹🏾 🤹🏿 🤽🏻 🤽🏼 🤽🏽 🤽🏾 🤽🏿 🤾🏻 🤾🏼 🤾🏽 🤾🏾 🤾🏿 🥷🏻 🥷🏼 🥷🏽 🥷🏾 🥷🏿 🦵🏻 🦵🏼 🦵🏽 🦵🏾 🦵🏿 🦶🏻 🦶🏼 🦶🏽 🦶🏾 🦶🏿 🦸🏻 🦸🏼 🦸🏽 🦸🏾 🦸🏿 🦹🏻 🦹🏼 🦹🏽 🦹🏾 🦹🏿 🦻🏻 🦻🏼 🦻🏽 🦻🏾 🦻🏿 🧍🏻 🧍🏼 🧍🏽 🧍🏾 🧍🏿 🧎🏻 🧎🏼 🧎🏽 🧎🏾 🧎🏿 🧏🏻 🧏🏼 🧏🏽 🧏🏾 🧏🏿 🧑🏻 🧑🏼 🧑🏽 🧑🏾 🧑🏿 🧒🏻 🧒🏼 🧒🏽 🧒🏾 🧒🏿 🧓🏻 🧓🏼 🧓🏽 🧓🏾 🧓🏿 🧔🏻 🧔🏼 🧔🏽 🧔🏾 🧔🏿 🧕🏻 🧕🏼 🧕🏽 🧕🏾 🧕🏿 🧖🏻 🧖🏼 🧖🏽 🧖🏾 🧖🏿 🧗🏻 🧗🏼 🧗🏽 🧗🏾 🧗🏿 🧘🏻 🧘🏼 🧘🏽 🧘🏾 🧘🏿 🧙🏻 🧙🏼 🧙🏽 🧙🏾 🧙🏿 🧚🏻 🧚🏼 🧚🏽 🧚🏾 🧚🏿 🧛🏻 🧛🏼 🧛🏽 🧛🏾 🧛🏿 🧜🏻 🧜🏼 🧜🏽 🧜🏾 🧜🏿 🧝🏻 🧝🏼 🧝🏽 🧝🏾 🧝🏿 🫃🏻 🫃🏼 🫃🏽 🫃🏾 🫃🏿 🫄🏻 🫄🏼 🫄🏽 🫄🏾 🫄🏿 🫅🏻 🫅🏼 🫅🏽 🫅🏾 🫅🏿 🫰🏻 🫰🏼 🫰🏽 🫰🏾 🫰🏿 🫱🏻 🫱🏼 🫱🏽 🫱🏾 🫱🏿 🫲🏻 🫲🏼 🫲🏽 🫲🏾 🫲🏿 🫳🏻 🫳🏼 🫳🏽 🫳🏾 🫳🏿 🫴🏻 🫴🏼 🫴🏽 🫴🏾 🫴🏿 🫵🏻 🫵🏼 🫵🏽 🫵🏾 🫵🏿 🫶🏻 🫶🏼 🫶🏽 🫶🏾 🫶🏿 🫷🏻 🫷🏼 🫷🏽 🫷🏾 🫷🏿 🫸🏻 🫸🏼 🫸🏽 🫸🏾 🫸🏿" .
        " ⌚️ ⌛️ ⏩️ ⏪️ ⏫️ ⏬️ ⏰️ ⏳️ ◽️ ◾️ ☔️ ☕️ ♈️ ♉️ ♊️ ♋️ ♌️ ♍️ ♎️ ♏️ ♐️ ♑️ ♒️ ♓️ ♿️ ⚓️ ⚡️ ⚪️ ⚫️ ⚽️ ⚾️ ⛄️ ⛅️ ⛎️ ⛔️ ⛪️ ⛲️ ⛳️ ⛵️ ⛺️ ⛽️ ✅️ ✊️ ✋️ ✨️ ❌️ ❎️ ❓️ ❔️ ❕️ ❗️ ➕️ ➖️ ➗️ ➰️ ➿️ ⬛️ ⬜️ ⭐️ ⭕️ 🀄️ 🈚️ 🈯️ 🌍️ 🌎️ 🌏️ 🌕️ 🌜️ 🍸️ 🎓️ 🎧️ 🎬️ 🎭️ 🎮️ 🏂️ 🏄️ 🏆️ 🏊️ 🏠️ 🏭️ 🐈️ 🐕️ 🐟️ 🐦️ 👂️ 👆️ 👇️ 👈️ 👉️ 👍️ 👎️ 👓️ 👪️ 👽️ 💣️ 💰️ 💳️ 💻️ 💿️ 📋️ 📚️ 📟️ 📤️ 📥️ 📦️ 📪️ 📫️ 📬️ 📭️ 📷️ 📹️ 📺️ 📻️ 🔈️ 🔍️ 🔒️ 🔓️ 🕐️ 🕑️ 🕒️ 🕓️ 🕔️ 🕕️ 🕖️ 🕗️ 🕘️ 🕙️ 🕚️ 🕛️ 🕜️ 🕝️ 🕞️ 🕟️ 🕠️ 🕡️ 🕢️ 🕣️ 🕤️ 🕥️ 🕦️ 🕧️ 😐️ 🚇️ 🚍️ 🚑️ 🚔️ 🚘️ 🚭️ 🚲️ 🚹️ 🚺️ 🚼️" .
        // 1 character
        " 🃏 🆎 🆑 🆒 🆓 🆔 🆕 🆖 🆗 🆘 🆙 🆚 🈁 🈲 🈳 🈴 🈵 🈶 🈸 🈹 🈺 🉐 🉑 🌀 🌁 🌂 🌃 🌄 🌅 🌆 🌇 🌈 🌉 🌊 🌋 🌌 🌐 🌑 🌒 🌓 🌔 🌖 🌗 🌘 🌙 🌚 🌛 🌝 🌞 🌟 🌠 🌭 🌮 🌯 🌰 🌱 🌲 🌳 🌴 🌵 🌷 🌸 🌹 🌺 🌻 🌼 🌽 🌾 🌿 🍀 🍁 🍂 🍃 🍄 🍅 🍆 🍇 🍈 🍉 🍊 🍋 🍌 🍍 🍎 🍏 🍐 🍑 🍒 🍓 🍔 🍕 🍖 🍗 🍘 🍙 🍚 🍛 🍜 🍝 🍞 🍟 🍠 🍡 🍢 🍣 🍤 🍥 🍦 🍧 🍨 🍩 🍪 🍫 🍬 🍭 🍮 🍯 🍰 🍱 🍲 🍳 🍴 🍵 🍶 🍷 🍹 🍺 🍻 🍼 🍾 🍿 🎀 🎁 🎂 🎃 🎄 🎅 🎆 🎇 🎈 🎉 🎊 🎋 🎌 🎍 🎎 🎏 🎐 🎑 🎒 🎠 🎡 🎢 🎣 🎤 🎥 🎦 🎨 🎩 🎪 🎫 🎯 🎰 🎱 🎲 🎳 🎴 🎵 🎶 🎷 🎸 🎹 🎺 🎻 🎼 🎽 🎾 🎿 🏀 🏁 🏃 🏅 🏇 🏈 🏉 🏏 🏐 🏑 🏒 🏓 🏡 🏢 🏣 🏤 🏥 🏦 🏧 🏨 🏩 🏪 🏫 🏬 🏮 🏯 🏰 🏴 🏸 🏹 🏺 🏻 🏼 🏽 🏾 🏿 🐀 🐁 🐂 🐃 🐄 🐅 🐆 🐇 🐉 🐊 🐋 🐌 🐍 🐎 🐏 🐐 🐑 🐒 🐓 🐔 🐖 🐗 🐘 🐙 🐚 🐛 🐜 🐝 🐞 🐠 🐡 🐢 🐣 🐤 🐥 🐧 🐨 🐩 🐪 🐫 🐬 🐭 🐮 🐯 🐰 🐱 🐲 🐳 🐴 🐵 🐶 🐷 🐸 🐹 🐺 🐻 🐼 🐽 🐾 👀 👃 👄 👅 👊 👋 👌 👏 👐 👑 👒 👔 👕 👖 👗 👘 👙 👚 👛 👜 👝 👞 👟 👠 👡 👢 👣 👤 👥 👦 👧 👨 👩 👫 👬 👭 👮 👯 👰 👱 👲 👳 👴 👵 👶 👷 👸 👹 👺 👻 👼 👾 👿 💀 💁 💂 💃 💄 💅 💆 💇 💈 💉 💊 💋 💌 💍 💎 💏 💐 💑 💒 💓 💔 💕 💖 💗 💘 💙 💚 💛 💜 💝 💞 💟 💠 💡 💢 💤 💥 💦 💧 💨 💩 💪 💫 💬 💭 💮 💯 💱 💲 💴 💵 💶 💷 💸 💹 💺 💼 💽 💾 📀 📁 📂 📃 📄 📅 📆 📇 📈 📉 📊 📌 📍 📎 📏 📐 📑 📒 📓 📔 📕 📖 📗 📘 📙 📛 📜 📝 📞 📠 📡 📢 📣 📧 📨 📩 📮 📯 📰 📱 📲 📳 📴 📵 📶 📸 📼 📿 🔀 🔁 🔂 🔃 🔄 🔅 🔆 🔇 🔉 🔊 🔋 🔌 🔎 🔏 🔐 🔑 🔔 🔕 🔖 🔗 🔘 🔙 🔚 🔛 🔜 🔝 🔞 🔟 🔠 🔡 🔢 🔣 🔤 🔥 🔦 🔧 🔨 🔩 🔪 🔫 🔬 🔭 🔮 🔯 🔰 🔱 🔲 🔳 🔴 🔵 🔶 🔷 🔸 🔹 🔺 🔻 🔼 🔽 🕋 🕌 🕍 🕎 🕺 🖕 🖖 🖤 🗻 🗼 🗽 🗾 🗿 😀 😁 😂 😃 😄 😅 😆 😇 😈 😉 😊 😋 😌 😍 😎 😏 😑 😒 😓 😔 😕 😖 😗 😘 😙 😚 😛 😜 😝 😞 😟 😠 😡 😢 😣 😤 😥 😦 😧 😨 😩 😪 😫 😬 😭 😮 😯 😰 😱 😲 😳 😴 😵 😶 😷 😸 😹 😺 😻 😼 😽 😾 😿 🙀 🙁 🙂 🙃 🙄 🙅 🙆 🙇 🙈 🙉 🙊 🙋 🙌 🙍 🙎 🙏 🚀 🚁 🚂 🚃 🚄 🚅 🚆 🚈 🚉 🚊 🚋 🚌 🚎 🚏 🚐 🚒 🚓 🚕 🚖 🚗 🚙 🚚 🚛 🚜 🚝 🚞 🚟 🚠 🚡 🚢 🚣 🚤 🚥 🚦 🚧 🚨 🚩 🚪 🚫 🚬 🚮 🚯 🚰 🚱 🚳 🚴 🚵 🚶 🚷 🚸 🚻 🚽 🚾 🚿 🛀 🛁 🛂 🛃 🛄 🛅 🛌 🛐 🛑 🛒 🛕 🛖 🛗 🛜 🛝 🛞 🛟 🛫 🛬 🛴 🛵 🛶 🛷 🛸 🛹 🛺 🛻 🛼 🟠 🟡 🟢 🟣 🟤 🟥 🟦 🟧 🟨 🟩 🟪 🟫 🟰 🤌 🤍 🤎 🤏 🤐 🤑 🤒 🤓 🤔 🤕 🤖 🤗 🤘 🤙 🤚 🤛 🤜 🤝 🤞 🤟 🤠 🤡 🤢 🤣 🤤 🤥 🤦 🤧 🤨 🤩 🤪 🤫 🤬 🤭 🤮 🤯 🤰 🤱 🤲 🤳 🤴 🤵 🤶 🤷 🤸 🤹 🤺 🤼 🤽 🤾 🤿 🥀 🥁 🥂 🥃 🥄 🥅 🥇 🥈 🥉 🥊 🥋 🥌 🥍 🥎 🥏 🥐 🥑 🥒 🥓 🥔 🥕 🥖 🥗 🥘 🥙 🥚 🥛 🥜 🥝 🥞 🥟 🥠 🥡 🥢 🥣 🥤 🥥 🥦 🥧 🥨 🥩 🥪 🥫 🥬 🥭 🥮 🥯 🥰 🥱 🥲 🥳 🥴 🥵 🥶 🥷 🥸 🥹 🥺 🥻 🥼 🥽 🥾 🥿 🦀 🦁 🦂 🦃 🦄 🦅 🦆 🦇 🦈 🦉 🦊 🦋 🦌 🦍 🦎 🦏 🦐 🦑 🦒 🦓 🦔 🦕 🦖 🦗 🦘 🦙 🦚 🦛 🦜 🦝 🦞 🦟 🦠 🦡 🦢 🦣 🦤 🦥 🦦 🦧 🦨 🦩 🦪 🦫 🦬 🦭 🦮 🦯 🦰 🦱 🦲 🦳 🦴 🦵 🦶 🦷 🦸 🦹 🦺 🦻 🦼 🦽 🦾 🦿 🧀 🧁 🧂 🧃 🧄 🧅 🧆 🧇 🧈 🧉 🧊 🧋 🧌 🧍 🧎 🧏 🧐 🧑 🧒 🧓 🧔 🧕 🧖 🧗 🧘 🧙 🧚 🧛 🧜 🧝 🧞 🧟 🧠 🧡 🧢 🧣 🧤 🧥 🧦 🧧 🧨 🧩 🧪 🧫 🧬 🧭 🧮 🧯 🧰 🧱 🧲 🧳 🧴 🧵 🧶 🧷 🧸 🧹 🧺 🧻 🧼 🧽 🧾 🧿 🩰 🩱 🩲 🩳 🩴 🩵 🩶 🩷 🩸 🩹 🩺 🩻 🩼 🪀 🪁 🪂 🪃 🪄 🪅 🪆 🪇 🪈 🪉 🪏 🪐 🪑 🪒 🪓 🪔 🪕 🪖 🪗 🪘 🪙 🪚 🪛 🪜 🪝 🪞 🪟 🪠 🪡 🪢 🪣 🪤 🪥 🪦 🪧 🪨 🪩 🪪 🪫 🪬 🪭 🪮 🪯 🪰 🪱 🪲 🪳 🪴 🪵 🪶 🪷 🪸 🪹 🪺 🪻 🪼 🪽 🪾 🪿 🫀 🫁 🫂 🫃 🫄 🫅 🫆 🫎 🫏 🫐 🫑 🫒 🫓 🫔 🫕 🫖 🫗 🫘 🫙 🫚 🫛 🫜 🫟 🫠 🫡 🫢 🫣 🫤 🫥 🫦 🫧 🫨 🫩 🫰 🫱 🫲 🫳 🫴 🫵 🫶 🫷 🫸";

        foreach (explode(' ', $allemojis) as $emoji) {    
            // Convert emoji to an array of Unicode code points
            $unicodePoints = [];
            $characters = preg_split('//u', $emoji, -1, PREG_SPLIT_NO_EMPTY);

            foreach ($characters as $char) {
                $unicodePoints[] = sprintf("%04x", mb_ord($char, 'UTF-8'));
            }

            // Join with underscores
            $unicode = implode('_', $unicodePoints);

            // Check if file exists
            $file = $CFG->dirroot . '/local/edai_pdf/pix/emoji/emoji_u' . $unicode . '.svg';
            if (!file_exists($file)) {
                $image = '';
            } else {
                // Prepare image
                $src = $CFG->wwwroot . '/local/edai_pdf/pix/emoji/emoji_u' . $unicode . '.svg';
                $attrs = [
                    'width' => '1.35em',
                    'height' => '1.35em'
                ];
                $image = \html_writer::img($src, '', $attrs);
            }

            // Replace emoji with image. Keep white space before emoji or add an invisible character.
            $content = str_replace(' ' . $emoji, ' ' . $image, $content);
            $content = str_replace($emoji, '&#12288;' . $image, $content);
        }

        return $content;
    }
}
